#!/usr/bin/python3

#
# Формат ввода
# В первой строке записаны через пробел два целых числа n (0 ≤ n ≤ 10^6) и
# k (1 ≤ k ≤ 8).
#
# Формат вывода
# Выведите единственное число – последние k цифр числа Fn.
#
# Если в искомом числе меньше k цифр, то выведите само число без ведущих нулей.
#
def Fib(n, m):
  if (n == 0) or (n == 1):
    return 1;
  
  ans = 0;

  a = 1;
  b = 1;

  mod = pow(10, m);
  
  ind = 0;
  
  for i in range(2, n + 1):
    a = (a + b) % mod;
    a, b = b, a;
    
  return b;

################################################################################

def main():
  nums = input().rstrip().split();

  n = int(nums[0]);
  k = int(nums[1]);
  
  print(Fib(n, k));

################################################################################

if __name__ == "__main__":
  main();
