#!/usr/bin/python3

#
# Формат ввода
# В первой строке дано число a (1 ≤ a ≤ 1000) –— основание, по которому
# считается хеш.
#
# Во второй строке дано число m (1 ≤ m ≤ 10^9) –— модуль.
#
# В третьей строке дана строка s (0 ≤ |s| ≤ 10^6), состоящая из больших и
# маленьких латинских букв.
#
# Формат вывода
# Выведите целое неотрицательное число –— хеш заданной строки.
#

import sys;

################################################################################

def HornerHash(s, base, mod):
  ln = len(s);

  if (ln == 1):
    return (ord(s) % mod);

  res = ord(s[0]);

  for i in range(1, ln):
    res = ( ord(s[i]) + res * base ) % mod;

  return res;

################################################################################

def main():
  base = int(input().rstrip());
  mod  = int(input().rstrip());
  str  = sys.stdin.readline().rstrip();

  if len(str) == 0:
    print(0);
    return;
  
  res = HornerHash(str, base, mod);

  print(res);

################################################################################

if __name__ == "__main__":
  main();
